microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51G18A.atdf
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA14"/>
              <signal group="WO" index="0" function="F" pad="PA30"/>
              <signal group="WO" index="1" function="F" pad="PA15"/>
              <signal group="WO" index="1" function="F" pad="PA31"/>
              <signal group="WO" index="2" function="F" pad="PA24"/>
              <signal group="WO" index="2" function="F" pad="PB02"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="3"/>
              <param name="DITHERING" value="0"/>
              <param name="DMAC_ID_OVF" value="34"/>
              <param name="DTI" value="0"/>
              <param name="EXT" value="1"/>
              <param name="GCLK_ID" value="29"/>
              <param name="MASTER_SLAVE_MODE" value="0"/>
              <param name="OTMX" value="1"/>
              <param name="OW_NUM" value="3"/>
              <param name="PG" value="0"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="U2242" version="1.1.0">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x42002800"/>
            <parameters>
              <param name="INSTANCE_ID" value="74"/>
            </parameters>
          </instance>
        </module>
        <module name="USB" id="U2222" version="1.2.0">
          <instance name="USB">
            <register-group name="USB" name-in-module="USB" address-space="base" offset="0x41000000"/>
            <signals>
              <signal group="DM" function="H" pad="PA24"/>
              <signal group="DP" function="H" pad="PA25"/>
              <signal group="SOF_1KHZ" function="H" pad="PA23"/>
              <signal group="SOF_1KHZ" function="H" pad="PB22"/>
            </signals>
            <parameters>
              <param name="AHB_2_USB_FIFO_DEPTH" value="4"/>
              <param name="AHB_2_USB_RD_DATA_BITS" value="8"/>
              <param name="AHB_2_USB_WR_DATA_BITS" value="32"/>
              <param name="AHB_2_USB_WR_THRESHOLD" value="2"/>
              <param name="DATA_BUS_16_8" value="0"/>
              <param name="EPNUM" value="8"/>
              <param name="EPT_NUM" value="8"/>
              <param name="GCLK_ID" value="10"/>
              <param name="INITIAL_CONTROL_QOS" value="3"/>
              <param name="INITIAL_DATA_QOS" value="3"/>
              <param name="MISSING_SOF_DET_IMPLEMENTED" value="1"/>
              <param name="PIPE_NUM" value="8"/>
              <param name="SYSTEM_CLOCK_IS_CKUSB" value="0"/>
              <param name="USB_2_AHB_FIFO_DEPTH" value="4"/>
              <param name="USB_2_AHB_RD_DATA_BITS" value="16"/>
              <param name="USB_2_AHB_RD_THRESHOLD" value="2"/>
              <param name="USB_2_AHB_WR_DATA_BITS" value="8"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2251" version="1.1.0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8"/>
            </parameters>
          </instance>
        </module>
      <module name="SystemControl">
            <instance name="SystemControl">
                <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
            </instance>
        </module><module name="SysTick">
            <instance name="SysTick">
                <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
            </instance>
        </module><module name="NVIC">
            <instance name="NVIC">
                <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
            </instance>
        </module><module name="MPU">
            <instance name="MPU">
                <register-group address-space="base" offset="0xE000ED90" name-in-module="MPU" name="MPU"/>
            </instance>
        </module></peripherals>
      <interrupts>
        <interrupt name="NonMaskableInt" index="-14" caption="Non Maskable Interrupt"/>
        <interrupt name="HardFault" index="-13" caption="Cortex-M4 Hard Fault Interrupt"/>
        <interrupt name="MemoryManagement" index="-12" caption="Cortex-M4 Memory Management Interrupt"/>
        <interrupt name="BusFault" index="-11" caption="Cortex-M4 Bus Fault Interrupt"/>
        <interrupt name="UsageFault" index="-10" caption="Cortex-M4 Usage Fault Interrupt"/>
        <interrupt name="SVCall" index="-5" caption="Cortex-M4 SV Call Interrupt"/>
        <interrupt name="DebugMonitor" index="-4" caption="Cortex-M4 Debug Monitor Interrupt"/>
        <interrupt name="PendSV" index="-2" caption="Cortex-M4 Pend SV Interrupt"/>
        <interrupt name="SysTick" index="-1" caption="Cortex-M4 System Tick Interrupt"/>
        <interrupt name="PM" index="0" module-instance="PM"/>
        <interrupt name="MCLK" index="1" module-instance="MCLK"/>
        <interrupt name="OSCCTRL_XOSC0" index="2" module-instance="OSCCTRL"/>
        <interrupt name="OSCCTRL_XOSC1" index="3" module-instance="OSCCTRL"/>
        <interrupt name="OSCCTRL_DFLL" index="4" module-instance="OSCCTRL"/>
        <interrupt name="OSCCTRL_DPLL0" index="5" module-instance="OSCCTRL"/>
        <interrupt name="OSCCTRL_DPLL1" index="6" module-instance="OSCCTRL"/>
        <interrupt name="OSC32KCTRL" index="7" module-instance="OSC32KCTRL"/>
        <interrupt name="SUPC_OTHER" index="8" module-instance="SUPC"/>
        <interrupt name="SUPC_BODDET" index="9" module-instance="SUPC"/>
        <interrupt name="WDT" index="10" module-instance="WDT"/>
        <interrupt name="RTC" index="11" module-instance="RTC"/>
        <interrupt name="EIC_EXTINT_0" index="12" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_1" index="13" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_2" index="14" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_3" index="15" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_4" index="16" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_5" index="17" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_6" index="18" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_7" index="19" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_8" index="20" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_9" index="21" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_10" index="22" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_11" index="23" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_12" index="24" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_13" index="25" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_14" index="26" module-instance="EIC"/>
        <interrupt name="EIC_EXTINT_15" index="27" module-instance="EIC"/>
        <interrupt name="FREQM" index="28" module-instance="FREQM"/>
        <interrupt name="NVMCTRL_0" index="29" module-instance="NVMCTRL"/>
        <interrupt name="NVMCTRL_1" index="30" module-instance="NVMCTRL"/>
        <interrupt name="DMAC_0" index="31" module-instance="DMAC"/>
        <interrupt name="DMAC_1" index="32" module-instance="DMAC"/>
        <interrupt name="DMAC_2" index="33" module-instance="DMAC"/>
        <interrupt name="DMAC_3" index="34" module-instance="DMAC"/>
        <interrupt name="DMAC_OTHER" index="35" module-instance="DMAC"/>
        <interrupt name="EVSYS_0" index="36" module-instance="EVSYS"/>
        <interrupt name="EVSYS_1" index="37" module-instance="EVSYS"/>
        <interrupt name="EVSYS_2" index="38" module-instance="EVSYS"/>
        <interrupt name="EVSYS_3" index="39" module-instance="EVSYS"/>
        <interrupt name="EVSYS_OTHER" index="40" module-instance="EVSYS"/>
        <interrupt name="PAC" index="41" module-instance="PAC"/>
        <interrupt name="TAL_BRK" index="42" module-instance="TAL"/>
        <interrupt name="TAL_IPS" index="43" module-instance="TAL"/>
        <interrupt name="RAMECC" index="45" module-instance="RAMECC"/>
        <interrupt name="SERCOM0_0" index="46" module-instance="SERCOM0"/>
        <interrupt name="SERCOM0_1" index="47" module-instance="SERCOM0"/>
        <interrupt name="SERCOM0_2" index="48" module-instance="SERCOM0"/>
        <interrupt name="SERCOM0_OTHER" index="49" module-instance="SERCOM0"/>
        <interrupt name="SERCOM1_0" index="50" module-instance="SERCOM1"/>
        <interrupt name="SERCOM1_1" index="51" module-instance="SERCOM1"/>
        <interrupt name="SERCOM1_2" index="52" module-instance="SERCOM1"/>
        <interrupt name="SERCOM1_OTHER" index="53" module-instance="SERCOM1"/>
        <interrupt name="SERCOM2_0" index="54" module-instance="SERCOM2"/>
        <interrupt name="SERCOM2_1" index="55" module-instance="SERCOM2"/>
        <interrupt name="SERCOM2_2" index="56" module-instance="SERCOM2"/>
        <interrupt name="SERCOM2_OTHER" index="57" module-instance="SERCOM2"/>
        <interrupt name="SERCOM3_0" index="58" module-instance="SERCOM3"/>
        <interrupt name="SERCOM3_1" index="59" module-instance="SERCOM3"/>
        <interrupt name="SERCOM3_2" index="60" module-instance="SERCOM3"/>
        <interrupt name="SERCOM3_OTHER" index="61" module-instance="SERCOM3"/>
        <interrupt name="SERCOM4_0" index="62" module-instance="SERCOM4"/>
        <interrupt name="SERCOM4_1" index="63" module-instance="SERCOM4"/>
        <interrupt name="SERCOM4_2" index="64" module-instance="SERCOM4"/>
        <interrupt name="SERCOM4_OTHER" index="65" module-instance="SERCOM4"/>
        <interrupt name="SERCOM5_0" index="66" module-instance="SERCOM5"/>
        <interrupt name="SERCOM5_1" index="67" module-instance="SERCOM5"/>
        <interrupt name="SERCOM5_2" index="68" module-instance="SERCOM5"/>
        <interrupt name="SERCOM5_OTHER" index="69" module-instance="SERCOM5"/>
        <interrupt name="USB_OTHER" index="80" module-instance="USB"/>
        <interrupt name="USB_SOF_HSOF" index="81" module-instance="USB"/>
        <interrupt name="USB_TRCPT0" index="82" module-instance="USB"/>
        <interrupt name="USB_TRCPT1" index="83" module-instance="USB"/>
        <interrupt name="TCC0_OTHER" index="85" module-instance="TCC0"/>
        <interrupt name="TCC0_MC0" index="86" module-instance="TCC0"/>
        <interrupt name="TCC0_MC1" index="87" module-instance="TCC0"/>
        <interrupt name="TCC0_MC2" index="88" module-instance="TCC0"/>
        <interrupt name="TCC0_MC3" index="89" module-instance="TCC0"/>
        <interrupt name="TCC0_MC4" index="90" module-instance="TCC0"/>
        <interrupt name="TCC0_MC5" index="91" module-instance="TCC0"/>
        <interrupt name="TCC1_OTHER" index="92" module-instance="TCC1"/>
        <interrupt name="TCC1_MC0" index="93" module-instance="TCC1"/>
        <interrupt name="TCC1_MC1" index="94" module-instance="TCC1"/>
        <interrupt name="TCC1_MC2" index="95" module-instance="TCC1"/>
        <interrupt name="TCC1_MC3" index="96" module-instance="TCC1"/>
        <interrupt name="TCC2_OTHER" index="97" module-instance="TCC2"/>
        <interrupt name="TCC2_MC0" index="98" module-instance="TCC2"/>
        <interrupt name="TCC2_MC1" index="99" module-instance="TCC2"/>
        <interrupt name="TCC2_MC2" index="100" module-instance="TCC2"/>
        <interrupt name="TC0" index="107" module-instance="TC0"/>
        <interrupt name="TC1" index="108" module-instance="TC1"/>
        <interrupt name="TC2" index="109" module-instance="TC2"/>
        <interrupt name="TC3" index="110" module-instance="TC3"/>
        <interrupt name="PDEC_OTHER" index="115" module-instance="PDEC"/>
        <interrupt name="PDEC_MC0" index="116" module-instance="PDEC"/>
        <interrupt name="PDEC_MC1" index="117" module-instance="PDEC"/>
        <interrupt name="ADC0_OTHER" index="118" module-instance="ADC0"/>
        <interrupt name="ADC0_RESRDY" index="119" module-instance="ADC0"/>
        <interrupt name="ADC1_OTHER" index="120" module-instance="ADC1"/>
        <interrupt name="ADC1_RESRDY" index="121" module-instance="ADC1"/>
        <interrupt name="AC" index="122" module-instance="AC"/>
        <interrupt name="DAC_OTHER" index="123" module-instance="DAC"/>
        <interrupt name="DAC_EMPTY_0" index="124" module-instance="DAC"/>
        <interrupt name="DAC_EMPTY_1" index="125" module-instance="DAC"/>
        <interrupt name="DAC_RESRDY_0" index="126" module-instance="DAC"/>
        <interrupt name="DAC_RESRDY_1" index="127" module-instance="DAC"/>
        <interrupt name="PCC" index="129" module-instance="PCC"/>
        <interrupt name="AES" index="130" module-instance="AES"/>
        <interrupt name="TRNG" index="131" module-instance="TRNG"/>
        <interrupt name="ICM" index="132" module-instance="ICM"/>
        <interrupt name="PUKCC" index="133" module-instance="PUKCC"/>
        <interrupt name="QSPI" index="134" module-instance="QSPI"/>
        <interrupt name="SDHC0" index="135" module-instance="SDHC0"/>
      </interrupts>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x60060008"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2501" version="1.0.0" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
