microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51G18A.atdf
        <register name="RANDSEED" offset="0x84" rw="RW" size="4" initval="0x00000000" caption="Random Seed">
        </register>
      </register-group>
      <value-group name="AES_CTRLA__AESMODE">
        <value name="ECB" caption="Electronic code book mode" value="0x0"/>
        <value name="CBC" caption="Cipher block chaining mode" value="0x1"/>
        <value name="OFB" caption="Output feedback mode" value="0x2"/>
        <value name="CFB" caption="Cipher feedback mode" value="0x3"/>
        <value name="COUNTER" caption="Counter mode" value="0x4"/>
        <value name="CCM" caption="CCM mode" value="0x5"/>
        <value name="GCM" caption="Galois counter mode" value="0x6"/>
      </value-group>
      <value-group name="AES_CTRLA__CFBS">
        <value name="128BIT" caption="128-bit Input data block for Encryption/Decryption in Cipher Feedback mode" value="0x0"/>
        <value name="64BIT" caption="64-bit Input data block for Encryption/Decryption in Cipher Feedback mode" value="0x1"/>
        <value name="32BIT" caption="32-bit Input data block for Encryption/Decryption in Cipher Feedback mode" value="0x2"/>
        <value name="16BIT" caption="16-bit Input data block for Encryption/Decryption in Cipher Feedback mode" value="0x3"/>
        <value name="8BIT" caption="8-bit Input data block for Encryption/Decryption in Cipher Feedback mode" value="0x4"/>
      </value-group>
      <value-group name="AES_CTRLA__CIPHER">
        <value name="DEC" caption="Decryption" value="0x0"/>
        <value name="ENC" caption="Encryption" value="0x1"/>
      </value-group>
      <value-group name="AES_CTRLA__KEYGEN">
        <value name="NONE" caption="No effect" value="0x0"/>
        <value name="LAST" caption="Start Computation of the last NK words of the expanded key" value="0x1"/>
      </value-group>
      <value-group name="AES_CTRLA__KEYSIZE">
        <value name="128BIT" caption="128-bit Key for Encryption / Decryption" value="0x0"/>
        <value name="192BIT" caption="192-bit Key for Encryption / Decryption" value="0x1"/>
        <value name="256BIT" caption="256-bit Key for Encryption / Decryption" value="0x2"/>
      </value-group>
      <value-group name="AES_CTRLA__LOD">
        <value name="NONE" caption="No effect" value="0x0"/>
        <value name="LAST" caption="Start encryption in Last Output Data mode" value="0x1"/>
      </value-group>
      <value-group name="AES_CTRLA__STARTMODE">
        <value name="MANUAL" caption="Start Encryption / Decryption in Manual mode" value="0x0"/>
        <value name="AUTO" caption="Start Encryption / Decryption in Auto mode" value="0x1"/>
      </value-group>
      <value-group name="AES_CTRLA__XORKEY">
        <value name="NONE" caption="No effect" value="0x0"/>
        <value name="XOR" caption="The user keyword gets XORed with the previous keyword register content." value="0x1"/>
      </value-group>
    </module>
    <module name="CCL" id="U2225" version="1.1.0" caption="Configurable Custom Logic">
      <register-group name="CCL" caption="Configurable Custom Logic">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
        </register>
        <register name="SEQCTRL" offset="0x4" rw="RW" size="1" count="2" initval="0x00" caption="SEQ Control x">
          <bitfield name="SEQSEL" caption="Sequential Selection" mask="0xF" values="CCL_SEQCTRL__SEQSEL"/>
        </register>
        <register name="LUTCTRL" offset="0x8" rw="RW" size="4" count="4" initval="0x00000000" caption="LUT Control x">
          <bitfield name="ENABLE" caption="LUT Enable" mask="0x2"/>
          <bitfield name="FILTSEL" caption="Filter Selection" mask="0x30" values="CCL_LUTCTRL__FILTSEL"/>
          <bitfield name="EDGESEL" caption="Edge Selection" mask="0x80"/>
          <bitfield name="INSEL0" caption="Input Selection 0" mask="0xF00" values="CCL_LUTCTRL__INSEL0"/>
          <bitfield name="INSEL1" caption="Input Selection 1" mask="0xF000" values="CCL_LUTCTRL__INSEL1"/>
          <bitfield name="INSEL2" caption="Input Selection 2" mask="0xF0000" values="CCL_LUTCTRL__INSEL2"/>
          <bitfield name="INVEI" caption="Inverted Event Input Enable" mask="0x100000"/>
          <bitfield name="LUTEI" caption="LUT Event Input Enable" mask="0x200000"/>
          <bitfield name="LUTEO" caption="LUT Event Output Enable" mask="0x400000"/>
          <bitfield name="TRUTH" caption="Truth Value" mask="0xFF000000"/>
        </register>
      </register-group>
      <value-group name="CCL_SEQCTRL__SEQSEL">
        <value name="DISABLE" caption="Sequential logic is disabled" value="0"/>
        <value name="DFF" caption="D flip flop" value="1"/>
        <value name="JK" caption="JK flip flop" value="2"/>
        <value name="LATCH" caption="D latch" value="3"/>
        <value name="RS" caption="RS latch" value="4"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__FILTSEL">
        <value name="DISABLE" caption="Filter disabled" value="0"/>
        <value name="SYNCH" caption="Synchronizer enabled" value="1"/>
        <value name="FILTER" caption="Filter enabled" value="2"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSEL0">
        <value name="MASK" caption="Masked input" value="0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="1"/>
        <value name="LINK" caption="Linked LUT input source" value="2"/>
        <value name="EVENT" caption="Event input source" value="3"/>
        <value name="IO" caption="I/O pin input source" value="4"/>
        <value name="AC" caption="AC input source" value="5"/>
        <value name="TC" caption="TC input source" value="6"/>
        <value name="ALTTC" caption="Alternate TC input source" value="7"/>
        <value name="TCC" caption="TCC input source" value="8"/>
        <value name="SERCOM" caption="SERCOM input source" value="9"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSEL1">
        <value name="MASK" caption="Masked input" value="0x0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="0x1"/>
        <value name="LINK" caption="Linked LUT input source" value="0x2"/>
        <value name="EVENT" caption="Event input source" value="0x3"/>
        <value name="IO" caption="I/O pin input source" value="0x4"/>
        <value name="AC" caption="AC input source" value="0x5"/>
        <value name="TC" caption="TC input source" value="0x6"/>
        <value name="ALTTC" caption="Alternate TC input source" value="0x7"/>
        <value name="TCC" caption="TCC input source" value="0x8"/>
        <value name="SERCOM" caption="SERCOM input source" value="0x9"/>
      </value-group>
