microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51G18A.atdf
        <register name="SFLAG" offset="0x230" rw="R" size="4" count="2" initval="0x00000000" caption="Inter-Process Signal Flag">
          <bitfield name="IPS0" caption="Inter-Process Signal 0" mask="0x1"/>
          <bitfield name="IPS1" caption="Inter-Process Signal 1" mask="0x2"/>
          <bitfield name="IPS2" caption="Inter-Process Signal 2" mask="0x4"/>
          <bitfield name="IPS3" caption="Inter-Process Signal 3" mask="0x8"/>
          <bitfield name="IPS4" caption="Inter-Process Signal 4" mask="0x10"/>
          <bitfield name="IPS5" caption="Inter-Process Signal 5" mask="0x20"/>
          <bitfield name="IPS6" caption="Inter-Process Signal 6" mask="0x40"/>
          <bitfield name="IPS7" caption="Inter-Process Signal 7" mask="0x80"/>
          <bitfield name="IPS8" caption="Inter-Process Signal 8" mask="0x100"/>
          <bitfield name="IPS9" caption="Inter-Process Signal 9" mask="0x200"/>
          <bitfield name="IPS10" caption="Inter-Process Signal 10" mask="0x400"/>
          <bitfield name="IPS11" caption="Inter-Process Signal 11" mask="0x800"/>
          <bitfield name="IPS12" caption="Inter-Process Signal 12" mask="0x1000"/>
          <bitfield name="IPS13" caption="Inter-Process Signal 13" mask="0x2000"/>
          <bitfield name="IPS14" caption="Inter-Process Signal 14" mask="0x4000"/>
          <bitfield name="IPS15" caption="Inter-Process Signal 15" mask="0x8000"/>
          <bitfield name="IPS16" caption="Inter-Process Signal 16" mask="0x10000"/>
          <bitfield name="IPS17" caption="Inter-Process Signal 17" mask="0x20000"/>
          <bitfield name="IPS18" caption="Inter-Process Signal 18" mask="0x40000"/>
          <bitfield name="IPS19" caption="Inter-Process Signal 19" mask="0x80000"/>
          <bitfield name="IPS20" caption="Inter-Process Signal 20" mask="0x100000"/>
          <bitfield name="IPS21" caption="Inter-Process Signal 21" mask="0x200000"/>
          <bitfield name="IPS22" caption="Inter-Process Signal 22" mask="0x400000"/>
          <bitfield name="IPS23" caption="Inter-Process Signal 23" mask="0x800000"/>
          <bitfield name="IPS24" caption="Inter-Process Signal 24" mask="0x1000000"/>
          <bitfield name="IPS25" caption="Inter-Process Signal 25" mask="0x2000000"/>
          <bitfield name="IPS26" caption="Inter-Process Signal 26" mask="0x4000000"/>
          <bitfield name="IPS27" caption="Inter-Process Signal 27" mask="0x8000000"/>
          <bitfield name="IPS28" caption="Inter-Process Signal 28" mask="0x10000000"/>
          <bitfield name="IPS29" caption="Inter-Process Signal 29" mask="0x20000000"/>
          <bitfield name="IPS30" caption="Inter-Process Signal 30" mask="0x40000000"/>
          <bitfield name="IPS31" caption="Inter-Process Signal 31" mask="0x80000000"/>
        </register>
        <register name="SFLAGCLRR" offset="0x300" rw="RW" size="1" count="64" initval="0x00" caption="Inter-Process Signal Flag Bit n">
          <bitfield name="IPS" caption="Inter-Process Signal n" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="TAL_CTICTRLA__BRK">
        <value name="BREAK" caption="Break when requested" value="0"/>
        <value name="INTERRUPT" caption="Trigger DBG interrupt instead of break" value="1"/>
        <value name="IGNORE" caption="Ignore break request" value="2"/>
      </value-group>
      <value-group name="TAL_CTICTRLA__IPS">
        <value name="EVENT" caption="Generate CPU Event when awaited resource is freed." value="0"/>
        <value name="INTERRUPT" caption="Generate Interrupt when awaited resource is freed." value="1"/>
      </value-group>
      <value-group name="TAL_CTICTRLA__RESTART">
        <value name="RESTART" caption="Restart when requested" value="0"/>
        <value name="IGNORE" caption="Ignore restart request" value="1"/>
      </value-group>
      <value-group name="TAL_IRQMON__EXTEND">
        <value name="NO" caption="Event is Interrupt Request signal" value="0"/>
        <value name="YES" caption="Event is Interrupt Request signal extended until end of Interrupt Handler" value="1"/>
      </value-group>
    </module>
    <module name="TC" id="U2249" version="3.0.0" caption="Basic Timer Counter">
      <register-group class="union" union-tag="TC.CTRLA.MODE" name="TC" caption="Basic Timer Counter">
        <register-group name="COUNT8" name-in-module="TC_COUNT8" union-tag-value="1" offset="0"/>
        <register-group name="COUNT16" name-in-module="TC_COUNT16" union-tag-value="0" offset="0"/>
        <register-group name="COUNT32" name-in-module="TC_COUNT32" union-tag-value="2" offset="0"/>
      </register-group>
      <register-group name="TC_COUNT8" caption="Basic Timer Counter - 8-bit Counter Mode">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Timer Counter Mode" mask="0xC" values="TC_CTRLA__MODE"/>
          <bitfield name="PRESCSYNC" caption="Prescaler and Counter Synchronization" mask="0x30" values="TC_CTRLA__PRESCSYNC"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="Clock On Demand" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0x700" values="TC_CTRLA__PRESCALER"/>
          <bitfield name="ALOCK" caption="Auto Lock" mask="0x800"/>
          <bitfield name="CAPTEN0" caption="Capture Channel 0 Enable" mask="0x10000"/>
          <bitfield name="CAPTEN1" caption="Capture Channel 1 Enable" mask="0x20000"/>
          <bitfield name="COPEN0" caption="Capture On Pin 0 Enable" mask="0x100000"/>
          <bitfield name="COPEN1" caption="Capture On Pin 1 Enable" mask="0x200000"/>
          <bitfield name="CAPTMODE0" caption="Capture Mode Channel 0" mask="0x3000000" values="TC_CTRLA__CAPTMODE0"/>
          <bitfield name="CAPTMODE1" caption="Capture mode Channel 1" mask="0x18000000" values="TC_CTRLA__CAPTMODE1"/>
        </register>
        <register name="CTRLBCLR" offset="0x4" rw="RW" access="RWSYNC" size="1" atomic-op="clear:CTRLBCLR" initval="0x00" caption="Control B Clear">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot on Counter" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="TC_CTRLBCLR__CMD"/>
        </register>
        <register name="CTRLBSET" offset="0x5" rw="RW" access="RWSYNC" size="1" atomic-op="set:CTRLBSET" initval="0x00" caption="Control B Set">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot on Counter" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="TC_CTRLBSET__CMD"/>
        </register>
